// Falcom TotalSoundDriver -> Midi Converter
// -----------------------------------------
// Written by Valley Bell, August 2021
// based on GMD -> Midi Converter
// Note: volume scaling for non-MIDI channels is not fully accurate
// TODO:
//	- "improvement" mode with higher pitch bend accuracy and chord support (which the driver lacks)
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>

#include <stdtype.h>

#ifndef INLINE
#if defined(_MSC_VER)
#define INLINE	static __inline
#elif defined(__GNUC__)
#define INLINE	static __inline__
#else
#define INLINE	static inline
#endif
#endif	// INLINE

#ifdef _MSC_VER
#define stricmp	_stricmp
#else
#define stricmp	strcasecmp
#endif


#include "midi_funcs.h"

typedef struct _track_info
{
	UINT32 startOfs;
	UINT32 loopOfs;
	UINT32 tickCnt;
	UINT32 loopTick;
	UINT16 loopTimes;
	UINT8 id;
	UINT8 mode;
	// bit 0: requires pitch bend
	// bit 3/4/5/6/7: sets Pan/Main Volume/Expression/Reverb/Chorus before first note
	// bit 8: sets pitch bend before first note
	UINT16 useFlags;
} TRK_INF;

#define BALANCE_TRACK_TIMES
#include "midi_utils.h"


static UINT8 WriteFileData(UINT32 DataLen, const UINT8* Data, const char* FileName);

INLINE INT16 VibratoLUT(UINT8 table, UINT16 index);
INLINE INT16 TremoloLUT(UINT16 index);
UINT8 Tsd2Mid(UINT32 songLen, const UINT8* songData);
static UINT8 TsdTrk2MidTrk(UINT32 songLen, const UINT8* songData,
							TRK_INF* trkInf, FILE_INF* fInf, MID_TRK_STATE* MTS);
static UINT8 PreparseTsdTrack(UINT32 songLen, const UINT8* songData, TRK_INF* trkInf, UINT8 mode);
INLINE INT32 NoteFrac2PitchBend(INT16 noteTransp, INT32 noteFrac);
static void WritePitchBend(FILE_INF* fInf, MID_TRK_STATE* MTS, INT32 pbVal);
INLINE UINT32 Tempo2Mid(UINT16 bpm, UINT16 scale);
INLINE UINT8 Note_OPNARhy2MidiDrum(UINT8 note);
INLINE UINT16 ReadLE16(const UINT8* data);


static const INT16 VIBRATO_TBLS[2][0x20] = {
	{
		// triangle
		  32,  64,  96, 128, 160, 192, 224, 255,
		 224, 192, 160, 128,  96,  64,  32,   0,
		 -32, -64, -96,-128,-160,-192,-224,-255,
		-224,-192,-160,-128, -96, -64, -32,   0,
	},
	{
		// sine-like
		  27,  79, 128, 171, 207, 234, 250, 255,
		 250, 234, 207, 171, 128,  79,  27,   0,
		 -27, -79,-128,-171,-207,-234,-250,-255,
		-250,-234,-207,-171,-128, -79, -27,   0,
	}
};
static const INT16 SUSTAIN_RATES[0x80] = {
	   1,    2,    3,    4,    5,    6,    8,   10,   12,   14,   16,   18,   20,   24,   28,   30,
	  36,   34,   36,   40,   42,   44,   46,   48,   52,   54,   56,   60,   64,   68,   72,   76,
	  80,   84,   88,   92,   96,  100,  110,  120,  128,  136,  144,  152,  160,  168,  176,  184,
	 188,  192,  216,  240,  264,  288,  312,  336,  360,  384,  408,  432,  456,  480,  504,  528,
	 552,  576,  600,  624,  648,  672,  696,  720,  744,  768,  792,  816,  840,  864,  888,  912,
	 936,  960,  984, 1008, 1032, 1056, 1080, 1104, 1128, 1152, 1176, 1200, 1224, 1248, 1272, 1296,
	1320, 1344, 1368, 1392, 1416, 1440, 1464, 1488, 1512, 1536, 1560, 1584, 1608, 1632, 1656, 1680,
	1704, 1728, 1752, 1776, 1800, 1824, 1848, 1872, 1896, 3000, 5000, 7000,10000,20000,30000,    0,
};

static UINT32 ROMLen;
static UINT8* ROMData;
static UINT32 MidLen;
static UINT8* MidData;

#define PB_RANGE	12	// hardcoded by the driver
static UINT16 MIDI_RES = 48;
static UINT16 NUM_LOOPS = 2;
static UINT8 NO_LOOP_EXT = 0;
static UINT8 DRIVER_BUGS = 0;
static UINT8 NO_TRK_NAMES = 0;
static UINT8 HIGH_PREC_PB = 0;
static UINT8 HIGH_PREC_VIB = 0;

int main(int argc, char* argv[])
{
	int argbase;
	FILE* hFile;
	UINT8 retVal;
	
	printf("Falcom TotalSoundDriver -> Midi Converter\n-----------------------------------------\n");
	if (argc < 3)
	{
		printf("Usage: tsd2mid.exe [options] input.bin output.mid\n");
		printf("Options:\n");
		printf("    -Loops n    Loop each track at least n times. (default: 2)\n");
		printf("    -NoLpExt    No Loop Extension\n");
		printf("                Do not fill short tracks to the length of longer ones.\n");
		printf("    -DriverBugs include oddities and bugs from the sound driver\n");
		printf("    -NoTrkNames omit channel/track names\n");
		printf("    -PrecisePB  enable higher-precision pitch bend calculations\n");
		printf("    -PreciseVib enable higher-precision vibrato (requires -PrecisePB)\n");
		printf("                Warning: This may result in slightly stronger vibarto.\n");
		return 0;
	}
	
	argbase = 1;
	while(argbase < argc && argv[argbase][0] == '-')
	{
		if (! stricmp(argv[argbase] + 1, "Loops"))
		{
			argbase ++;
			if (argbase < argc)
			{
				NUM_LOOPS = (UINT16)strtoul(argv[argbase], NULL, 0);
				if (! NUM_LOOPS)
					NUM_LOOPS = 2;
			}
		}
		else if (! stricmp(argv[argbase] + 1, "NoLpExt"))
			NO_LOOP_EXT = 1;
		else if (! stricmp(argv[argbase] + 1, "DriverBugs"))
			DRIVER_BUGS = 1;
		else if (! stricmp(argv[argbase] + 1, "NoTrkNames"))
			NO_TRK_NAMES = 1;
		else if (! stricmp(argv[argbase] + 1, "PrecisePB"))
			HIGH_PREC_PB = 1;
		else if (! stricmp(argv[argbase] + 1, "PreciseVib"))
			HIGH_PREC_VIB = 1;
		else
			break;
		argbase ++;
	}
	if (argc < argbase + 2)
	{
		printf("Not enough arguments.\n");
		return 0;
	}
	
	hFile = fopen(argv[argbase + 0], "rb");
	if (hFile == NULL)
	{
		printf("Error opening file!\n");
		return 1;
	}
	
	fseek(hFile, 0x00, SEEK_END);
	ROMLen = ftell(hFile);
	if (ROMLen > 0x100000)	// 1 MB
		ROMLen = 0x100000;
	
	fseek(hFile, 0x00, SEEK_SET);
	ROMData = (UINT8*)malloc(ROMLen);
	fread(ROMData, 0x01, ROMLen, hFile);
	
	fclose(hFile);
	
	retVal = Tsd2Mid(ROMLen, ROMData);
	if (! retVal)
		WriteFileData(MidLen, MidData, argv[argbase + 1]);
	free(MidData);	MidData = NULL;
	
	printf("Done.\n");
	
	free(ROMData);	ROMData = NULL;
	
#ifdef _DEBUG
	//getchar();
#endif
	
	return 0;
}

static UINT8 WriteFileData(UINT32 DataLen, const UINT8* Data, const char* FileName)
{
	FILE* hFile;
	
	hFile = fopen(FileName, "wb");
	if (hFile == NULL)
	{
		printf("Error opening %s!\n", FileName);
		return 0xFF;
	}
	
	fwrite(Data, 0x01, DataLen, hFile);
	fclose(hFile);
	
	return 0;
}

INLINE INT16 VibratoLUT(UINT8 table, UINT16 index)
{
	INT16 result = VIBRATO_TBLS[table][index & 0x1F];
	if (HIGH_PREC_PB && HIGH_PREC_VIB)	// don't do this in "non-precise vibrato" mode - due to lower precision 255 actually fits better
	{
		// patch 255 to 256, for a nicer triangle shape
		// The code divides by 256 anyway.
		if (result == -255)
			result = -256;
		else if (result == +255)
			result = +256;
	}
	return result;
}

INLINE INT16 TremoloLUT(UINT16 index)
{
	INT16 result = VIBRATO_TBLS[0][0x10 | (index & 0x0F)];
	if (HIGH_PREC_PB && result == -255)
		result = -256;
	return result;
}

UINT8 Tsd2Mid(UINT32 songLen, const UINT8* songData)
{
	TRK_INF trkInf[0x10];
	TRK_INF* tempTInf;
	UINT8 tempArr[0x20];
	UINT8 trkCnt;
	UINT16 trkPtr[0x10];
	UINT16 trkMode[0x10];
	UINT8 curTrk;
	UINT32 inPos;
	UINT32 tempLng;
	UINT8 retVal;
	FILE_INF midFInf;
	MID_TRK_STATE MTS;
	
	midFInf.alloc = 0x20000;	// 128 KB should be enough
	midFInf.data = (UINT8*)malloc(midFInf.alloc);
	midFInf.pos = 0x00;
	
	trkCnt = 0x10;
	inPos = 0x00;
	for (curTrk = 0; curTrk < trkCnt; curTrk ++, inPos += 0x02)
		trkPtr[curTrk] = ReadLE16(&songData[inPos]);
	for (curTrk = 0; curTrk < trkCnt; curTrk ++, inPos += 0x02)
		trkMode[curTrk] = ReadLE16(&songData[inPos]);
	//ReadLE16(&songData[0x40]);	// SSG instrument pointer
	//songData[0x42];	// number of FM instruments
	//songData[0x43];	// number of SSG instruments
	//inPos = 0x50;	// start of GM instruments
	
	for (curTrk = 0; curTrk < trkCnt; curTrk ++)
	{
		tempTInf = &trkInf[curTrk];
		tempTInf->startOfs = trkPtr[curTrk];
		tempTInf->loopOfs = 0x0000;
		tempTInf->tickCnt = 0;
		tempTInf->loopTick = 0;
		tempTInf->id = curTrk;
		tempTInf->mode = (UINT8)trkMode[curTrk];
		
		if (tempTInf->startOfs)
			PreparseTsdTrack(songLen, songData, tempTInf, 0);
		if (tempTInf->loopOfs)
			PreparseTsdTrack(songLen, songData, tempTInf, 1);	// pass #2 to count the actual loop length
		tempTInf->loopTimes = tempTInf->loopOfs ? NUM_LOOPS : 0;
	}
	
	if (! NO_LOOP_EXT)
		BalanceTrackTimes(trkCnt, trkInf, MIDI_RES / 4, 0xFF);
	
	WriteMidiHeader(&midFInf, 0x0001, trkCnt, MIDI_RES);
	
	retVal = 0x00;
	for (curTrk = 0; curTrk < trkCnt; curTrk ++)
	{
		WriteMidiTrackStart(&midFInf, &MTS);
		
		if (curTrk == 0)
		{
			// first track: write global song information
			tempLng = Tempo2Mid(120, 0x40);
			WriteBE32(tempArr, tempLng);
			WriteMetaEvent(&midFInf, &MTS, 0x51, 0x03, &tempArr[0x01]);
		}
		
		if (trkInf[curTrk].startOfs)	// offset 0 == track disabled
			retVal = TsdTrk2MidTrk(songLen, songData, &trkInf[curTrk], &midFInf, &MTS);
		
		WriteEvent(&midFInf, &MTS, 0xFF, 0x2F, 0x00);
		WriteMidiTrackEnd(&midFInf, &MTS);
		
		if (retVal)
		{
			if (retVal == 0x01)
				printf("Early EOF when trying to read track %u!\n", 1 + curTrk);
			break;
		}
	}
	
	MidData = midFInf.data;
	MidLen = midFInf.pos;
	
	midFInf.pos = 0x00;
	WriteMidiHeader(&midFInf, 0x0001, curTrk, MIDI_RES);
	
	return retVal;
}

static UINT8 TsdTrk2MidTrk(UINT32 songLen, const UINT8* songData,
							TRK_INF* trkInf, FILE_INF* fInf, MID_TRK_STATE* MTS)
{
	static const UINT8 OPNA_PAN_LUT[0x04] = {0x3F, 0x7F, 0x01, 0x40};
	UINT32 inPos;
	UINT32 trkTick;
	UINT8 chnMode;
	UINT8 chnID;
	// bit 0: pitch to next note / "no attack" mode
	// bit 1: enable early Note Off
	// bit 4/5/6/7: [frequency effects] enable portamento / vibrato / pitch slide / vibrato during portamento
	// bit 8/9: [volume effects] enable tremolo / envelope
	UINT16 chnFlags;
	UINT8 transp;
	UINT8 trkEnd;
	UINT8 cmdType;
	INT8 noteTransp;	// transposition for non-MIDI channels
	UINT8 chnVolScale;
	UINT8 curNote;
	UINT8 lastNote;
	UINT8 noteVel;
	UINT8 nVelSingle;
	UINT8 chnVol;
	UINT8 chnPan;
	UINT8 lastVol;
	INT32 lastPB;
	UINT8 loopIdx;
	UINT16 mstLoopCnt;
	UINT32 loopPos[8];
	UINT16 loopMax[8];	// total loop count
	UINT16 loopCnt[8];	// remaining loops
	char tempStr[0x20];
	UINT16 songTempo;
	UINT16 noteLenMod;
	UINT32 noteStartTick;
	UINT32 noteOffTick;
	INT16 pbDetune;
	UINT16 portaDurat;
	INT32 portaRange;
	
	UINT8 vibDelay;	// 25 initial delay
	UINT8 vibCurDly;	// 26 current delay
	INT8 vibStrength;	// 27
	INT8 vibSpeed;	// 28
	UINT8 vibType;	// 29
	INT16 vibPos;	// 2A
	
	UINT8 trmDelay;	// 1E initial delay
	UINT8 trmCurDly;	// 1F current delay
	UINT8 trmStrength;	// 20
	UINT8 trmVolScale;	// 21
	UINT8 trmSpeed;	// 22
	UINT16 trmPos;	// 23
	
	UINT8 psldDelay;
	UINT8 psldCurDly;
	INT16 psldDelta;
	INT16 psldFreq;
	
	UINT8 vevAtkLvl;	// 36
	UINT8 vevAtkTime;	// 37
	UINT8 vevDecTime;	// 38
	UINT8 vevDecLvl;	// 39
	UINT8 vevSusRate;	// 3A
	UINT8 vevRelTime;	// 3B
	UINT8 vevPhase;	// 3C
	INT16 vevTick;	// 3D
	UINT8 vevVol;	// 3F
	
	if (trkInf->startOfs >= songLen)
		return 0x01;
	if (trkInf->mode & 0x01)
		printf("Warning Track %u: Invalid channel mode 0x02X\n", trkInf->id, trkInf->mode);
	
	trkEnd = 0;
	inPos = trkInf->startOfs;
	chnFlags = 0x080;	// "vibrato during portamento" is enabled by default
	songTempo = 120;
	noteTransp = 0;
	chnVolScale = 1;
	curNote = 0xFF;
	lastNote = 0xFF;
	noteVel = 0;	// driver default
	nVelSingle = 0;
	chnVol = 0x00;	// driver default
	chnPan = 0x40;
	lastVol = chnVol;
	lastPB = 0;
	transp = 0;
	noteLenMod = 0;
	noteOffTick = 0;
	noteStartTick = 0;
	pbDetune = 0;
	vibDelay = 0;
	vibCurDly = 0;
	trmDelay = 0;
	trmCurDly = 0;
	psldDelay = 0;
	psldCurDly = 0;
	psldDelta = 0;
	psldFreq = 0;
	loopIdx = 0x00;
	mstLoopCnt = 0;
	vevPhase = 0;
	MTS->curDly = 0;
	
	if (trkInf->mode < 0x14)	// OPN/OPNA channels
	{
		chnID = trkInf->mode / 2;
		chnMode = chnID / 3;
		chnID %= 3;
		if (chnMode == 0)	// FM 4..6
		{
			chnID += 3;
			MTS->midChn = chnID;
			chnMode = 0;
