// Falcom TotalSoundDriver -> Midi Converter
// -----------------------------------------
// Written by Valley Bell, August 2021
// based on GMD -> Midi Converter
// Note: volume scaling for non-MIDI channels is not fully accurate
// TODO:
//	- "improvement" mode with chord support (which the driver lacks)
//	  This mode would make 0-tick notes longer when on a drum track OR the sustain pedal is pressed.
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>

#include "stdtype.h"

#ifndef INLINE
#if defined(_MSC_VER)
#define INLINE	static __inline
#elif defined(__GNUC__)
#define INLINE	static __inline__
#else
#define INLINE	static inline
#endif
#endif	// INLINE

#ifdef _MSC_VER
#define stricmp	_stricmp
#else
#define stricmp	strcasecmp
#endif


#include "midi_funcs.h"

typedef struct _track_info
{
	UINT32 startOfs;
	UINT32 loopOfs;
	UINT32 tickCnt;
	UINT32 loopTick;
	UINT16 loopTimes;
	UINT8 id;
	UINT8 mode;
	// bit 0: requires pitch bend
	// bit 3/4/5/6/7: sets Pan/Main Volume/Expression/Reverb/Chorus before first note
	// bit 8: sets pitch bend before first note
	UINT16 useFlags;
} TRK_INF;

typedef struct _track_ram
{
	// bit 0: pitch to next note / "no attack" mode
	// bit 1: enable early Note Off
	// bit 4/5/6/7: [frequency effects] enable portamento / vibrato / pitch slide / vibrato during portamento
	// bit 8/9: [volume effects] enable tremolo / envelope
	UINT16 chnFlags;
	
	UINT8 curNote;
	UINT8 lastNote;
	INT8 noteTransp;	// transposition for non-MIDI channels
	UINT8 chnVolScale;
	UINT8 chnVol;
	UINT8 lastVol;
	UINT8 noteVel;	// 42
	UINT8 nVelSingle;	// 43
	UINT8 chnPan;
	INT32 lastPB;
	
	UINT8 loopIdx;
	UINT32 loopPos[8];
	UINT16 loopMax[8];	// total loop count
	UINT16 loopCnt[8];	// remaining loops
	
	UINT16 noteLenMod;	// 0E/0F
	UINT32 noteStartTick;
	UINT32 noteOffTick;	// 0A/0B
	INT16 pbDetune;	// 18/19
	UINT16 portaDurat;	// 2E/2F
	INT32 portaRange;	// 2C/2D
	
	UINT8 vibDelay;	// 25 initial delay
	UINT8 vibCurDly;	// 26 current delay
	INT8 vibStrength;	// 27
	INT8 vibSpeed;	// 28
	UINT8 vibType;	// 29
	INT16 vibPos;	// 2A/2B
	
	UINT8 trmDelay;	// 1E initial delay
	UINT8 trmCurDly;	// 1F current delay
	UINT8 trmStrength;	// 20
	UINT8 trmVolScale;	// 21
	UINT8 trmSpeed;	// 22
	UINT16 trmPos;	// 23/24
	
	UINT8 psldDelay;	// 31
	UINT8 psldCurDly;	// 30
	INT16 psldDelta;	// 32/33
	INT16 psldFreq;	// 34/35
	
	UINT8 vevAtkLvl;	// 36
	UINT8 vevAtkTime;	// 37
	UINT8 vevDecTime;	// 38
	UINT8 vevDecLvl;	// 39
	UINT8 vevSusRate;	// 3A
	UINT8 vevRelTime;	// 3B
	UINT8 vevPhase;	// 3C
	INT16 vevTick;	// 3D
	UINT8 vevVol;	// 3F
} TRK_RAM;

#define BALANCE_TRACK_TIMES
#include "midi_utils.h"


static UINT8 WriteFileData(UINT32 DataLen, const UINT8* Data, const char* FileName);

INLINE INT16 VibratoLUT(UINT8 table, UINT16 index);
INLINE INT16 TremoloLUT(UINT16 index);
UINT8 Tsd2Mid(UINT32 songLen, const UINT8* songData);
static UINT8 TsdTrk2MidTrk(UINT32 songLen, const UINT8* songData,
							TRK_INF* trkInf, FILE_INF* fInf, MID_TRK_STATE* MTS);
static UINT8 LookAheadCommand(UINT32 songLen, const UINT8* songData, UINT32 startPos, UINT8 cmd, UINT8 chnMode);
static UINT8 PreparseTsdTrack(UINT32 songLen, const UINT8* songData, TRK_INF* trkInf, UINT8 mode);
INLINE INT32 NoteFrac2PitchBend(INT16 noteTransp, INT32 noteFrac);
static void WritePitchBend(FILE_INF* fInf, MID_TRK_STATE* MTS, INT32 pbVal);
INLINE UINT32 Tempo2Mid(UINT16 bpm, UINT16 scale);
INLINE UINT8 Note_OPNARhy2MidiDrum(UINT8 note);
INLINE UINT16 ReadLE16(const UINT8* data);


static const INT16 VIBRATO_TBLS[2][0x20] = {
	{
